start_msg = '''**Добро пожаловать в Komaru Protection, где спокойствие и безопасность — наш приоритет.** 🌐

*Komaru Protection* — ваш надёжный страж, автоматически блокирующий рейдеров и защищающий чат от нежелательных гостей.

Для получения полной информации и возможностей, введите команду `/help`.

Сейчас работает компактная, но эффективная антирейд система, которая всегда на страже. 🛡️
'''

raider_msg = '''⚠️ *Обнаружен* [рейдер]({link})!

Пользователь был идентифицирован как рейдер и отправлен в бан. 🚫

Ваш чат под надежной защитой! 🛡️
'''

raiders_msg = "⚠️ *Обнаружены* рейдеры!\n\nБот будет банить рейдеров в течении минуты без оповещения. 🚫\n\nВаш чат под надежной защитой! 🛡️"

alert_msg = '''🚨 *Предупреждение* 🚨

Эта база данных может содержать *не только рейдеров*, но и пользователей, попавших туда *по ошибке* или *неадекватных*, но *не являющихся рейдерами*.

💡 **Вы уверены, что хотите установить эту базу данных?**
'''

dont_set = '''👀 Вижу вы еще не настроили базу, сейчас по умолчанию стоит lite. Выберите базу данных, которая будет использоваться для обнаружения рейдеров:'''

dont_have_rights = "❌ У вас нет прав для выполнения этой команды. Только администраторы с правом назначения администраторов могут использовать эту команду."

help_msg = '''🤖 *Komaru Protection Bot - Ваш защитник от рейдеров!*

👋 *Добро пожаловать!* Этот бот создан для обеспечения безопасности ваших чатов и защиты от нежелательных участников. Вот список доступных команд и возможностей:

📜 *Основные команды:*
`/start` - Начать работу с ботом и получить основное меню.
`/help` - Показать это справочное сообщение с информацией о командах и возможностях.
`/menu` - Выбрать базу данных для проверки рейдеров, включить/выключить антирейд.'''